##############################################################################################################################################
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ #
#                      /$$                   /$$                         /$$        |                                                        #
#                     | $$                  | $$                        | $$        | Author: Muneeb Mennad                                  #
#   /$$$$$$   /$$$$$$$| $$$$$$$   /$$$$$$$ /$$$$$$    /$$$$$$   /$$$$$$$| $$$$$$$   | Project Name: Password Strength Checker & Generator    #
#  /$$__  $$ /$$_____/| $$__  $$ /$$_____/|_  $$_/   /$$__  $$ /$$_____/| $$__  $$  | File Name: main.py                                     #
# | $$  \ $$| $$      | $$  \ $$|  $$$$$$   | $$    | $$  \ $$| $$      | $$  \ $$  | Project Start: 2026-01-24                              #
# | $$  | $$| $$      | $$  | $$ \____  $$  | $$ /$$| $$  | $$| $$      | $$  | $$  | Github Username: pchstpch                              #
# | $$$$$$$/|  $$$$$$$| $$  | $$ /$$$$$$$/  |  $$$$/| $$$$$$$/|  $$$$$$$| $$  | $$  |                                                        #
# | $$____/  \_______/|__/  |__/|_______/    \___/  | $$____/  \_______/|__/  |__/  |                                                        #
# | $$                                              | $$                            |                                                        #
# | $$                                              | $$                            |                                                        #
# |__/                                              |__/                            |                                                        #
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ #
##############################################################################################################################################

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ #
import entropy
import password_generator

def userOption():
    option = int(input())
    if option == 1:
        passwordCheckerMenu()
    elif option == 2:
        passwordGeneratorMenu()
    else:
        print("Have a wonderful day 😄")

def getUserPassword():
    userPassword = input("Please enter your password: ")
    return userPassword

def passwordMode():
    mode = int(input("Answer: "))
    return mode

def getGeneratedPassword(mode):
    generatedPassword = password_generator.generatePassword(mode)
    return generatedPassword

def displayPasswordEntropy():
     print("Entropy: {:.1f}".format(entropy.getEntropy(getUserPassword())))
    
def displayTimeToCrack():
    print("Time to crack (in years): {:.1f}".format(entropy.getTimeToCrack(getUserPassword())))

def displayGeneratedPassword(mode):
    print("Your generated password is: " + getGeneratedPassword(mode))
    
def passwordCheckerMenu():
    print("Password Strength Checker 📊")
    print("Details...")
    print()
    displayPasswordEntropy()
    print()
    displayTimeToCrack()

def passwordGeneratorMenu():
    print("")
    print("Password Generator 🔒")
    print("Please answer the questions below to generate a password")
    print()
    print("What kind of password you would like? (Enter '1' or '2')")
    print()
    print("1. Passphrase (Easier to remember)")
    print("Example: swell posing gruffly slander onto")
    print()
    print("2. Random String (Alphanumeric)")
    print("Example: a9Fq7XrL2mP8ZKcE")
    print()
    # TODO: Add a 3rd option as 3. Random String (Alphanumeric + Symbols)
    displayGeneratedPassword(passwordMode())
    print("Select an option to continue:")
    print("1. Check your new generated password's strength")
    print("2. Generate a new password")
    print("3. Quit")
    
        
def displayMenu():
    # Change up this design (maybe change project name)
    print("=================================================================================================================================================================================================")
    print("=================================================================================================================================================================================================")
    print(r" ▗▄▄▖  ▗▄▖  ▗▄▄▖ ▗▄▄▖▗▖ ▗▖ ▗▄▖ ▗▄▄▖ ▗▄▄▄      ▗▄▄▖▗▄▄▄▖▗▄▄▖ ▗▄▄▄▖▗▖  ▗▖ ▗▄▄▖▗▄▄▄▖▗▖ ▗▖     ▗▄▄▖▗▖ ▗▖▗▄▄▄▖ ▗▄▄▖▗▖ ▗▖▗▄▄▄▖▗▄▄▖      ▗▄▖ ▗▖  ▗▖▗▄▄▄      ▗▄▄▖▗▄▄▄▖▗▖  ▗▖▗▄▄▄▖▗▄▄▖  ▗▄▖▗▄▄▄▖▗▄▖ ▗▄▄▖ ")
    print(r" ▐▌ ▐▌▐▌ ▐▌▐▌   ▐▌   ▐▌ ▐▌▐▌ ▐▌▐▌ ▐▌▐▌  █    ▐▌     █  ▐▌ ▐▌▐▌   ▐▛▚▖▐▌▐▌     █  ▐▌ ▐▌    ▐▌   ▐▌ ▐▌▐▌   ▐▌   ▐▌▗▞▘▐▌   ▐▌ ▐▌    ▐▌ ▐▌▐▛▚▖▐▌▐▌  █    ▐▌   ▐▌   ▐▛▚▖▐▌▐▌   ▐▌ ▐▌▐▌ ▐▌ █ ▐▌ ▐▌▐▌ ▐▌")
    print(r" ▐▛▀▘ ▐▛▀▜▌ ▝▀▚▖ ▝▀▚▖▐▌ ▐▌▐▌ ▐▌▐▛▀▚▖▐▌  █     ▝▀▚▖  █  ▐▛▀▚▖▐▛▀▀▘▐▌ ▝▜▌▐▌▝▜▌  █  ▐▛▀▜▌    ▐▌   ▐▛▀▜▌▐▛▀▀▘▐▌   ▐▛▚▖ ▐▛▀▀▘▐▛▀▚▖    ▐▛▀▜▌▐▌ ▝▜▌▐▌  █    ▐▌▝▜▌▐▛▀▀▘▐▌ ▝▜▌▐▛▀▀▘▐▛▀▚▖▐▛▀▜▌ █ ▐▌ ▐▌▐▛▀▚▖")
    print(r" ▐▌   ▐▌ ▐▌▗▄▄▞▘▗▄▄▞▘▐▙█▟▌▝▚▄▞▘▐▌ ▐▌▐▙▄▄▀    ▗▄▄▞▘  █  ▐▌ ▐▌▐▙▄▄▖▐▌  ▐▌▝▚▄▞▘  █  ▐▌ ▐▌    ▝▚▄▄▖▐▌ ▐▌▐▙▄▄▖▝▚▄▄▖▐▌ ▐▌▐▙▄▄▖▐▌ ▐▌    ▐▌ ▐▌▐▌  ▐▌▐▙▄▄▀    ▝▚▄▞▘▐▙▄▄▖▐▌  ▐▌▐▙▄▄▖▐▌ ▐▌▐▌ ▐▌ █ ▝▚▄▞▘▐▌ ▐▌")
    print("=================================================================================================================================================================================================")
    print("=================================================================================================================================================================================================")
    print("Welcome to Password Strength Checker and Generator! 👋")
    print("Text that describes what this does...")
    print()
    print("Choose an option to continue:")
    print("1. Check your password strength")
    print("2. Generate a new random password")
    print("3. Quit")
    print()
    userOption()

if __name__ == "__main__":
    displayMenu()
        
# end main
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ #